Дошкольное_учреждение83/src/InformationRegisters/СостоянияДокументов/СостоянияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияДокументов</types>
    </type>
  </resources>
  <attributes>
    <name>Установил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>BusinessProcessRef</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/InformationRegisters/СостоянияДелХраненияДокументов/СостоянияДелХраненияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияДелХраненияДокументов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияДелХраненияДокументов</types>
    </type>
  </resources>
  <dimensions>
    <name>ДелоХраненияДокументов</name>
    <type>
      <types>CatalogRef.ДелаХраненияДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/Enums/СостоянияДокументов/СостоянияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияДокументов</name>
  <enumValues>
    <name>Проект</name>
  </enumValues>
  <enumValues>
    <name>НаРассмотрении</name>
  </enumValues>
  <enumValues>
    <name>Рассмотрен</name>
  </enumValues>
  <enumValues>
    <name>НаИсполнении</name>
  </enumValues>
  <enumValues>
    <name>Исполнен</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>НаУтверждении</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>НеУтвержден</name>
  </enumValues>
  <enumValues>
    <name>НаРегистрации</name>
  </enumValues>
  <enumValues>
    <name>Зарегистрирован</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Enums/ПериодичностьНумераторов/ПериодичностьНумераторов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПериодичностьНумераторов</name>
  <enumValues>
    <name>Год</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Непериодический</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Catalogs/Файлы/Файлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Файлы</name>
  <comment>Файлы в папках</comment>
  <attributes>
    <name>Автор</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <comment>Владелец файла</comment>
    <type>
      <types>BusinessProcessRef.Задание</types>
      <types>CatalogRef.ПапкиФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаема</name>
    <comment>Дата заема на редактирование</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата добавления файла в базу</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <comment>Файл зашифрован</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс иконки, соответствующей расширению файла, для показа в списке</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭЦП</name>
    <comment>Файл подписан ЭЦП</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <comment>Полное наименование (длиной до 256 символов)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <comment>Пользователь, занявший файл для редактирования</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <comment>Текст, извлеченный из файла - для полнотекстового поиска</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсия</name>
    <comment>Активная версия</comment>
    <type>
      <types>CatalogRef.ВерсииФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияАвтор</name>
    <comment>Автор - пользователь, создавший версию</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияДатаМодификацииФайла</name>
    <comment>Дата модификации файла - в локальном времени</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияДатаСоздания</name>
    <comment>Дата создания версии</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияКод</name>
    <comment>Текущая версия код</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияНомерВерсии</name>
    <comment>Номер версии</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияПутьКФайлу</name>
    <comment>Дополнительный путь к файлу на диске (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияРазмер</name>
    <comment>Размер файла версии</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияРасширение</name>
    <comment>Расширение файла версии</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияТом</name>
    <comment>Ссылка на том (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьВерсии</name>
    <comment>Хранить версии - если Ложь, у файла всегда одна версия - активная</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СертификатыШифрования</name>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Catalogs/ВходящиеДокументы/ВходящиеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВходящиеДокументы</name>
  <basedOn>Catalog.ИсходящиеДокументы</basedOn>
  <attributes>
    <name>АвторРезолюции</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Адресат</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыВходящихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВОтветНа</name>
    <type>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрифДоступа</name>
    <type>
      <types>CatalogRef.ГрифыДоступа</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРезолюции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Дело</name>
    <type>
      <types>CatalogRef.ДелаХраненияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Зарегистрировал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛистов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПриложений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистовВПриложениях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленОтвет</name>
    <type>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписал</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение адресата</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметПереписки</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Резолюция</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПолучения</name>
    <type>
      <types>CatalogRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <comment>Плановый срок исполнения</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>удуДержательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>удуРебенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Catalogs/ВидыВходящихДокументов/ВидыВходящихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыВходящихДокументов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>СпособНумерации</name>
    <type>
      <types>EnumRef.СпособыНумерации</types>
    </type>
  </attributes>
  <attributes>
    <name>Нумератор</name>
    <type>
      <types>CatalogRef.Нумераторы</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>удуУчетПоДетям</name>
    <comment>Указывает необходимость отметки ребенка, в отношении которого зарегистрирован документ</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Дошкольное_учреждение83/src/CommonModules/Делопроизводство/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////
// МОДУЛЬ СОДЕРЖИТ ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ВНУТРЕННИМИ, ВХОДЯЩИМИ И ИСХОДЯЩИМИ ДОКУМЕНТАМИ
// 

// Формирует наименование документа из заголовка 
Функция НаименованиеДокумента(Документ) Экспорт 
	
	Заголовок = СокрЛП(Документ.Заголовок);
	ДлинаНаименования = Документ.Метаданные().ДлинаНаименования;
	
	Если ЗначениеЗаполнено(Документ.РегистрационныйНомер) Тогда 
		Постфикс = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСТР("ru = ' (№ %1 от %2)'"),
						СокрЛП(Документ.РегистрационныйНомер),
						Формат(Документ.ДатаРегистрации, "ДЛФ=D"));
	Иначе
		Постфикс = "";
	КонецЕсли;	
	
	Если СтрДлина(Заголовок + Постфикс) > ДлинаНаименования Тогда 
		
		Заголовок = Лев(Заголовок, ДлинаНаименования - СтрДлина(Постфикс));
		ДлинаЗаголовка = СтрДлина(Заголовок);
		
		ПозицияПробела = ДлинаЗаголовка;
		Пока ПозицияПробела > 0 Цикл
			Если Сред(Заголовок, ПозицияПробела, 1) = " " Тогда 
				Прервать;
			КонецЕсли;	
			ПозицияПробела = ПозицияПробела - 1;
		КонецЦикла;	
		
		Если ПозицияПробела > 1 Тогда 
			Заголовок = Лев(Заголовок, ПозицияПробела - 1);
		КонецЕсли;	
		
	КонецЕсли;	
	
	Возврат Заголовок + Постфикс;
	
КонецФункции	

// Формирует наименование номенклатуры дел
Функция НаименованиеНоменклатурыДел(НоменклатураДел) Экспорт
	
	Заголовок = НоменклатураДел.ПолноеНаименование;
	Заголовок = СтрЗаменить(Заголовок, Символы.ПС, " "); 
	Заголовок = СокрЛП(Заголовок);
	ДлинаНаименования = НоменклатураДел.Метаданные().ДлинаНаименования;
	
	Если СтрДлина(Заголовок) > ДлинаНаименования Тогда 
		
		Заголовок = Лев(Заголовок, ДлинаНаименования);
		ДлинаЗаголовка = СтрДлина(Заголовок);
		
		ПозицияПробела = ДлинаЗаголовка;
		Пока ПозицияПробела > 0 Цикл
			Если Сред(Заголовок, ПозицияПробела, 1) = " " Тогда 
				Прервать;
			КонецЕсли;	
			ПозицияПробела = ПозицияПробела - 1;
		КонецЦикла;	
		
		Если ПозицияПробела > 1 Тогда 
			Заголовок = Лев(Заголовок, ПозицияПробела - 1);
		КонецЕсли;	
		
	КонецЕсли;	
	
	Возврат Заголовок;
	
КонецФункции	

// Возвращает количество файлов по документу
Функция КоличествоФайлов(Документ) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	Справочник.Файлы КАК Файлы
	|ГДЕ
	|	Файлы.ВладелецФайла = &Документ";
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат 0;
	КонецЕсли;	
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Количество;
	
КонецФункции

// Возвращает количество задач по документу
Функция КоличествоЗадач(Документ, ТолькоНевыполненные = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|ГДЕ
	|	ЗадачаИсполнителя.Предмет = &Документ
	|	И (НЕ ЗадачаИсполнителя.ПометкаУдаления)";
	
	Если ТолькоНевыполненные Тогда 
		Запрос.Текст = Запрос.Текст + " И (НЕ ЗадачаИсполнителя.Выполнена)";
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат 0;
	КонецЕсли;	
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Количество;
	
КонецФункции	

// Возвращает вид документа по умолчанию
Функция ПолучитьВидДокументаПоУмолчанию(Ссылка) Экспорт
	
	ВидДокумента = Неопределено;
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.ВходящиеДокументы") Тогда 
		ВидДокумента = ХранилищеОбщихНастроек.Загрузить("НастройкиРаботыСДокументами", "ВидВходящегоДокумента");
		ТипМетаданных = "ВидыВходящихДокументов";
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.ИсходящиеДокументы") Тогда 
		ВидДокумента = ХранилищеОбщихНастроек.Загрузить("НастройкиРаботыСДокументами", "ВидИсходящегоДокумента");
		ТипМетаданных = "ВидыИсходящихДокументов";
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.ВнутренниеДокументы") Тогда 
		ВидДокумента = ХранилищеОбщихНастроек.Загрузить("НастройкиРаботыСДокументами", "ВидВнутреннегоДокумента");
		ТипМетаданных = "ВидыВнутреннихДокументов";
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(ВидДокумента) Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = СтрЗаменить(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ТаблицаВидаДокументов.Ссылка КАК Ссылка
		|ИЗ
		|	&ВидДокумента КАК ТаблицаВидаДокументов
		|ГДЕ
		|	(НЕ ТаблицаВидаДокументов.ПометкаУдаления)
		|	И (НЕ ТаблицаВидаДокументов.ЭтоГруппа)
		|	И ЛОЖЬ В
		|			(ВЫБРАТЬ
		|				ЛОЖЬ КАК ЗначениеЛожь
		|			ИЗ
		|				(ВЫБРАТЬ ПЕРВЫЕ 2
		|					ИСТИНА КАК ЗначениеИстина
		|				ИЗ
		|					&ВидДокумента КАК ТаблицаВидаДокументов
		|				ГДЕ
		|					(НЕ ТаблицаВидаДокументов.ПометкаУдаления)
		|					И (НЕ ТаблицаВидаДокументов.ЭтоГруппа)
		|				) КАК ВыбранныеОбъекты
		|			ИМЕЮЩИЕ
		|				КОЛИЧЕСТВО(ВыбранныеОбъекты.ЗначениеИстина) = 1)", "&ВидДокумента", "Справочник." + ТипМетаданных);
	
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда 
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			ВидДокумента = Выборка.Ссылка;
		КонецЕсли;	
	КонецЕсли;	
		
	Возврат ВидДокумента;
	
КонецФункции	

// Возвращает способ доставки по умолчанию
Функция ПолучитьСпособДоставкиПоУмолчанию(Тип) Экспорт 
	
	СпособДоставки = Справочники.СпособыДоставки.ПустаяСсылка();
	
	Если Тип = "СпособПолучения" Тогда 
		СпособДоставки = ХранилищеОбщихНастроек.Загрузить("НастройкиРаботыСДокументами", "СпособПолучения");
	ИначеЕсли Тип = "СпособОтправки" Тогда 
		СпособДоставки = ХранилищеОбщихНастроек.Загрузить("НастройкиРаботыСДокументами", "СпособОтправки");
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(СпособДоставки) Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СпособыДоставки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СпособыДоставки КАК СпособыДоставки
		|ГДЕ
		|	(НЕ СпособыДоставки.ПометкаУдаления)
		|	И ЛОЖЬ В
		|			(ВЫБРАТЬ
		|				ЛОЖЬ КАК ЗначениеЛожь
		|			ИЗ
		|				(ВЫБРАТЬ ПЕРВЫЕ 2
		|					ИСТИНА КАК ЗначениеИстина
		|				ИЗ
		|					Справочник.СпособыДоставки КАК СпособыДоставки
		|				ГДЕ
		|					(НЕ СпособыДоставки.ПометкаУдаления)
		|				) КАК ВыбранныеОбъекты
		|			ИМЕЮЩИЕ
		|				КОЛИЧЕСТВО(ВыбранныеОбъекты.ЗначениеИстина) = 1)";
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда 
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			СпособДоставки = Выборка.Ссылка;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат СпособДоставки;
	
КонецФункции	

// Получает актуальное состояние документа
Функция ПолучитьСостояниеДокумента(Документ) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат Перечисления.СостоянияДокументов.ПустаяСсылка();
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостоянияДокументовСрезПоследних.Состояние КАК Состояние
	|ИЗ
	|	РегистрСведений.СостоянияДокументов.СрезПоследних(, Документ = &Документ) КАК СостоянияДокументовСрезПоследних";
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		Возврат Перечисления.СостоянияДокументов.ПустаяСсылка();
	КонецЕсли;	
		
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Состояние; 
	
КонецФункции

// Устанавливает состояние документа
Процедура ЗаписатьСостояниеДокумента(Документ, Период, Состояние, Установил) Экспорт
	
	ТекущееСостояние = ПолучитьСостояниеДокумента(Документ);
	Если ТекущееСостояние = Состояние Тогда 
		Возврат;
	КонецЕсли;	
	
	МенеджерЗаписи = РегистрыСведений.СостоянияДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = Период;
	МенеджерЗаписи.Документ = Документ;
	МенеджерЗаписи.Состояние = Состояние;
	МенеджерЗаписи.Установил = Установил;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры	

// Возвращает ключ актуального состояния документа
Функция ПолучитьКлючСостоянияДокумента(Документ) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостоянияДокументовСрезПоследних.Период КАК Период
	|ИЗ
	|	РегистрСведений.СостоянияДокументов.СрезПоследних(, Документ = &Документ) КАК СостоянияДокументовСрезПоследних";
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		Возврат Неопределено;
	КонецЕсли;	
		
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат РегистрыСведений.СостоянияДокументов.СоздатьКлючЗаписи( Новый Структура("Период, Документ", Выборка.Период, Документ) );
	
КонецФункции

// Возвращает признак использования видов входящих документов
Функция ИспользоватьВидыВходящихДокументов() Экспорт 
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьВидыВходящихДокументов");
	
КонецФункции

// Возвращает признак использования видов исходящих документов
Функция ИспользоватьВидыИсходящихДокументов() Экспорт 
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьВидыИсходящихДокументов");
	
КонецФункции

// Возвращает признак использования видов внутренних документов
Функция ИспользоватьВидыВнутреннихДокументов() Экспорт 
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьВидыВнутреннихДокументов");
	
КонецФункции

// Возвращает признак использования видов документов по объекту
Функция ИспользоватьВидыДокументов(Объект) Экспорт
	
	ИспользоватьВидыДокументов = Ложь;
	
	Если ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.ВходящиеДокументы") Тогда 
		ИспользоватьВидыДокументов = Делопроизводство.ИспользоватьВидыВходящихДокументов();
		
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.ИсходящиеДокументы") Тогда 
		ИспользоватьВидыДокументов = Делопроизводство.ИспользоватьВидыИсходящихДокументов();
		
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.ВнутренниеДокументы") Тогда 
		ИспользоватьВидыДокументов = Делопроизводство.ИспользоватьВидыВнутреннихДокументов();
		
	КонецЕсли;	
	
	Возврат ИспользоватьВидыДокументов;
	
КонецФункции	

// Возвращает признак использования номенклатуры дел
Функция ИспользоватьНоменклатуруДел() Экспорт 
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьНоменклатуруДел");
	
КонецФункции

Функция РегистрационныйНомерУникален(Объект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Нумератор = Нумерация.ПолучитьНумераторДокумента(Объект);
	Если ЗначениеЗаполнено(Нумератор) Тогда // автонумерация
		Периодичность = Нумератор.Периодичность;
	Иначе 										   // ручная нумерация
		Периодичность = Перечисления.ПериодичностьНумераторов.Год;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Справочник." + Объект.Метаданные().Имя + "
	|ГДЕ
	|	РегистрационныйНомер = &РегистрационныйНомер
	|	И Ссылка <> &Ссылка";
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОрганизациям") И Нумератор.НезависимаяНумерацияПоОрганизациям Тогда
		Запрос.Текст = Запрос.Текст + " И (Организация = &Организация) ";
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
	КонецЕсли;	
	
	Если ИспользоватьВидыДокументов(Объект) Тогда 
		Запрос.Текст = Запрос.Текст + " И (ВидДокумента = &ВидДокумента) ";
		Запрос.УстановитьПараметр("ВидДокумента", Объект.ВидДокумента);
	КонецЕсли;	
	
	ЕСли ТипЗнч(Объект.Ссылка) <> Тип("СправочникСсылка.удуРеестрыОтправки") Тогда
		Запрос.Текст = Запрос.Текст + " И ДатаРегистрации МЕЖДУ &НачалоПериодаНумерации И &КонецПериодаНумерации ";
		Если ИспользоватьВидыДокументов(Объект) Тогда 
			Запрос.Текст = Запрос.Текст + " И (ВидДокумента = &ВидДокумента) ";
			Запрос.УстановитьПараметр("ВидДокумента", Объект.ВидДокумента);
		КонецЕсли;	
	
		Запрос.УстановитьПараметр("НачалоПериодаНумерации", Нумерация.НачалоПериодаНумерации(Периодичность, Объект.ДатаРегистрации));
		Запрос.УстановитьПараметр("КонецПериодаНумерации", Нумерация.КонецПериодаНумерации(Периодичность, Объект.ДатаРегистрации));
	Иначе
		Запрос.Текст = Запрос.Текст + " И ДатаОтправки МЕЖДУ &НачалоПериодаНумерации И &КонецПериодаНумерации ";
		Запрос.Текст = Запрос.Текст + " И (ТипРеестра = &ТипРеестра) ";
		Запрос.УстановитьПараметр("ТипРеестра", Объект.ТипРеестра);
		Запрос.УстановитьПараметр("НачалоПериодаНумерации", Нумерация.НачалоПериодаНумерации(Периодичность, Объект.ДатаОтправки));
		Запрос.УстановитьПараметр("КонецПериодаНумерации", Нумерация.КонецПериодаНумерации(Периодичность, Объект.ДатаОтправки));
	КонецЕсли;

		Запрос.УстановитьПараметр("РегистрационныйНомер", Объект.РегистрационныйНомер);
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
		Результат = Запрос.Выполнить();
	Возврат Результат.Пустой();
	
КонецФункции	

Процедура УстановитьДоступностьПоСостоянию(Форма, Состояние, ДоступныеПоля = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДоступныеПоля = "";
	НедоступныеПоля = "";
	
	Если РольДоступна("ПолныеПрава") Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Форма.Объект.Ссылка) = Тип("СправочникСсылка.ВходящиеДокументы") Тогда 
		РольДелопроизводитель = РольДоступна("ДобавлениеИзменениеВходящихДокументов");
		
	ИначеЕсли ТипЗнч(Форма.Объект.Ссылка) = Тип("СправочникСсылка.ИсходящиеДокументы") Тогда 
		РольДелопроизводитель = РольДоступна("РегистрацияИсходящихДокументов");
		
	ИначеЕсли ТипЗнч(Форма.Объект.Ссылка) = Тип("СправочникСсылка.ВнутренниеДокументы") Тогда 	
		РольДелопроизводитель = РольДоступна("РегистрацияВнутреннихДокументов");
		
	КонецЕсли;	
	
	
	Если Состояние = Перечисления.СостоянияДокументов.НаРегистрации Тогда 	
		
		Если РольДелопроизводитель Тогда 
			ДоступныеПоля = "";
			НедоступныеПоля = "";
		Иначе
			ДоступныеПоля = Новый Структура("
			|Состояние, 
			|ОткрытьФайл, СохранитьКак, НастроитьСписок, ВывестиСписок,
			|КонтекстноеМенюФайлыОткрытьФайл, КонтекстноеМенюФайлыСохранитьКак");
		КонецЕсли;
		
	ИначеЕсли (Состояние = Перечисления.СостоянияДокументов.Зарегистрирован) 
	    	И (ТипЗнч(Форма.Объект.Ссылка) = Тип("СправочникСсылка.ВходящиеДокументы")) Тогда
		
		Если РольДелопроизводитель Тогда
			ДоступныеПоля = Новый Структура("
			|Зарегистрировать, РегистрационныйНомер, ДатаРегистрации,
			|Состояние, 
			|СрокИсполнения, Дело,
			|ОткрытьФайл, СохранитьКак, НастроитьСписок, ВывестиСписок,
			|КонтекстноеМенюФайлыОткрытьФайл, КонтекстноеМенюФайлыСохранитьКак");
		Иначе
			ДоступныеПоля = Новый Структура("
			|ОткрытьФайл, СохранитьКак, НастроитьСписок, ВывестиСписок,
			|КонтекстноеМенюФайлыОткрытьФайл, КонтекстноеМенюФайлыСохранитьКак");
		КонецЕсли;
		
	ИначеЕсли (Состояние = Перечисления.СостоянияДокументов.Зарегистрирован) 
			И (ТипЗнч(Форма.Объект.Ссылка) = Тип("СправочникСсылка.ИсходящиеДокументы")) Тогда
		
		Если РольДелопроизводитель Тогда 
			Если Форма.Объект.Отправлен Тогда
				ДоступныеПоля = Новый Структура("
				|Зарегистрировать, РегистрационныйНомер, ДатаРегистрации,
				|Состояние, 
				|СрокИсполнения, Дело,
				|Отправлен, ДатаОтправки, СпособОтправки,
				|ОткрытьФайл, СохранитьКак, НастроитьСписок, ВывестиСписок,
				|КонтекстноеМенюФайлыОткрытьФайл, КонтекстноеМенюФайлыСохранитьКак");
			Иначе
				ДоступныеПоля = Новый Структура("
				|Зарегистрировать, РегистрационныйНомер, ДатаРегистрации,
				|Состояние, 
				|СрокИсполнения, Дело,
				|ЗакончитьРедактирование, Занять, Освободить, Редактировать, СохранитьИзменения, ОбновитьИзФайлаНаДиске,
				|КонтекстноеМенюФайлыЗакончитьРедактирование, КонтекстноеМенюФайлыЗанять, КонтекстноеМенюФайлыОсвободить, КонтекстноеМенюФайлыРедактировать, КонтекстноеМенюФайлыСохранитьИзменения, КонтекстноеМенюФайлыОбновитьИзФайлаНаДиске,
				|Отправлен, ДатаОтправки, СпособОтправки,
				|ОткрытьФайл, СохранитьКак, НастроитьСписок, ВывестиСписок,
				|КонтекстноеМенюФайлыОткрытьФайл, КонтекстноеМенюФайлыСохранитьКак");
			КонецЕсли;
		Иначе
			ДоступныеПоля = Новый Структура("
			|ОткрытьФайл, СохранитьКак, НастроитьСписок, ВывестиСписок,
			|КонтекстноеМенюФайлыОткрытьФайл, КонтекстноеМенюФайлыСохранитьКак");
		КонецЕсли;
		
	ИначеЕсли (Состояние = Перечисления.СостоянияДокументов.Зарегистрирован) 
			И (ТипЗнч(Форма.Объект.Ссылка) = Тип("СправочникСсылка.ВнутренниеДокументы")) Тогда
		
		Если РольДелопроизводитель Тогда 
			ДоступныеПоля = Новый Структура("
			|Зарегистрировать, РегистрационныйНомер, ДатаРегистрации,
			|Состояние, 
			|СрокИсполнения, Дело,
			|ЗакончитьРедактирование, Занять, Освободить, Редактировать, СохранитьИзменения, ОбновитьИзФайлаНаДиске,
			|КонтекстноеМенюФайлыЗакончитьРедактирование, КонтекстноеМенюФайлыЗанять, КонтекстноеМенюФайлыОсвободить, КонтекстноеМенюФайлыРедактировать, КонтекстноеМенюФайлыСохранитьИзменения, КонтекстноеМенюФайлыОбновитьИзФайлаНаДиске,
			|ОткрытьФайл, СохранитьКак, НастроитьСписок, ВывестиСписок,
			|КонтекстноеМенюФайлыОткрытьФайл, КонтекстноеМенюФайлыСохранитьКак");
		Иначе
			ДоступныеПоля = Новый Структура("
			|ОткрытьФайл, СохранитьКак, НастроитьСписок, ВывестиСписок,
			|КонтекстноеМенюФайлыОткрытьФайл, КонтекстноеМенюФайлыСохранитьКак");
		КонецЕсли;
		
	ИначеЕсли Состояние = Перечисления.СостоянияДокументов.НаРассмотрении Тогда	
		
		Если РольДелопроизводитель Тогда 
			ДоступныеПоля = Новый Структура("
			|Зарегистрировать, РегистрационныйНомер, ДатаРегистрации,
			|Состояние, 
			|СрокИсполнения, 
			|Резолюция, ДатаРезолюции, АвторРезолюции,
			|ОткрытьФайл, СохранитьКак, НастроитьСписок, ВывестиСписок,
			|КонтекстноеМенюФайлыОткрытьФайл, КонтекстноеМенюФайлыСохранитьКак");
		Иначе
			ДоступныеПоля = Новый Структура("
			|ОткрытьФайл, СохранитьКак, НастроитьСписок, ВывестиСписок,
			|КонтекстноеМенюФайлыОткрытьФайл, КонтекстноеМенюФайлыСохранитьКак");
		КонецЕсли;
		
	ИначеЕсли Состояние = Перечисления.СостоянияДокументов.Рассмотрен Тогда	
		
		Если РольДелопроизводитель Тогда 
			ДоступныеПоля = Новый Структура("
			|Зарегистрировать, РегистрационныйНомер, ДатаРегистрации,
			|Состояние, 
			|СрокИсполнения, 
			|ОткрытьФайл, СохранитьКак, НастроитьСписок, ВывестиСписок,
			|КонтекстноеМенюФайлыОткрытьФайл, КонтекстноеМенюФайлыСохранитьКак");
		Иначе
			ДоступныеПоля = Новый Структура("
			|ОткрытьФайл, СохранитьКак, НастроитьСписок, ВывестиСписок,
			|КонтекстноеМенюФайлыОткрытьФайл, КонтекстноеМенюФайлыСохранитьКак");
		КонецЕсли;
		
	ИначеЕсли Состояние = Перечисления.СостоянияДокументов.НаИсполнении Тогда	
		
		Если РольДелопроизводитель Тогда 
			ДоступныеПоля = Новый Структура("
			|Зарегистрировать, РегистрационныйНомер, ДатаРегистрации,
			|Состояние, 
			|СрокИсполнения, 
			|ОткрытьФайл, СохранитьКак, НастроитьСписок, ВывестиСписок,
			|КонтекстноеМенюФайлыОткрытьФайл, КонтекстноеМенюФайлыСохранитьКак");
		Иначе
			ДоступныеПоля = Новый Структура("
			|ОткрытьФайл, СохранитьКак, НастроитьСписок, ВывестиСписок,
			|КонтекстноеМенюФайлыОткрытьФайл, КонтекстноеМенюФайлыСохранитьКак");
		КонецЕсли;
		
	ИначеЕсли Состояние = Перечисления.СостоянияДокументов.Исполнен Тогда
		
		Если РольДелопроизводитель Тогда 
			ДоступныеПоля = Новый Структура("
			|Зарегистрировать, РегистрационныйНомер, ДатаРегистрации,
			|Состояние, 
			|Дело, 
			|ОткрытьФайл, СохранитьКак, НастроитьСписок, ВывестиСписок,
			|КонтекстноеМенюФайлыОткрытьФайл, КонтекстноеМенюФайлыСохранитьКак");
		Иначе
			ДоступныеПоля = Новый Структура("
			|ОткрытьФайл, СохранитьКак, НастроитьСписок, ВывестиСписок,
			|КонтекстноеМенюФайлыОткрытьФайл, КонтекстноеМенюФайлыСохранитьКак");
		КонецЕсли;
		
	ИначеЕсли Состояние = Перечисления.СостоянияДокументов.Проект
		Или Состояние = Перечисления.СостоянияДокументов.НеСогласован
		Или Состояние = Перечисления.СостоянияДокументов.НеУтвержден Тогда
		
		ДоступныеПоля = "";
		НедоступныеПоля = Новый Структура("СрокИсполнения, Подписал, Утвердил, Дело");
		
	ИначеЕсли Состояние = Перечисления.СостоянияДокументов.НаСогласовании Тогда
		
		ДоступныеПоля = Новый Структура("
		|Состояние, 
		|ЗакончитьРедактирование, Занять, Освободить, Редактировать, СохранитьИзменения, ОбновитьИзФайлаНаДиске,
		|КонтекстноеМенюФайлыЗакончитьРедактирование, КонтекстноеМенюФайлыЗанять, КонтекстноеМенюФайлыОсвободить, КонтекстноеМенюФайлыРедактировать, КонтекстноеМенюФайлыСохранитьИзменения, КонтекстноеМенюФайлыОбновитьИзФайлаНаДиске,
		|ОткрытьФайл, СохранитьКак, НастроитьСписок, ВывестиСписок,
		|КонтекстноеМенюФайлыОткрытьФайл, КонтекстноеМенюФайлыСохранитьКак");
		
	ИначеЕсли Состояние = Перечисления.СостоянияДокументов.НаУтверждении Тогда
		
		ДоступныеПоля = Новый Структура("
		|Состояние, 
		|Подписал, Утвердил,
		|ЗакончитьРедактирование, Занять, Освободить, Редактировать, СохранитьИзменения, ОбновитьИзФайлаНаДиске,
		|КонтекстноеМенюФайлыЗакончитьРедактирование, КонтекстноеМенюФайлыЗанять, КонтекстноеМенюФайлыОсвободить, КонтекстноеМенюФайлыРедактировать, КонтекстноеМенюФайлыСохранитьИзменения, КонтекстноеМенюФайлыОбновитьИзФайлаНаДиске,
		|ОткрытьФайл, СохранитьКак, НастроитьСписок, ВывестиСписок,
		|КонтекстноеМенюФайлыОткрытьФайл, КонтекстноеМенюФайлыСохранитьКак");
		
	ИначеЕсли Состояние = Перечисления.СостоянияДокументов.Согласован
		Или Состояние = Перечисления.СостоянияДокументов.Утвержден Тогда	
		
		Если РольДелопроизводитель Тогда 
			ДоступныеПоля = Новый Структура("
			|Состояние, 
			|Зарегистрировать,
			|ОткрытьФайл, СохранитьКак, НастроитьСписок, ВывестиСписок,
			|КонтекстноеМенюФайлыОткрытьФайл, КонтекстноеМенюФайлыСохранитьКак");
		Иначе
			ДоступныеПоля = Новый Структура("
			|Состояние, 
			|ОткрытьФайл, СохранитьКак, НастроитьСписок, ВывестиСписок,
			|КонтекстноеМенюФайлыОткрытьФайл, КонтекстноеМенюФайлыСохранитьКак");
		КонецЕсли;	  
		
	КонецЕсли;	
	
	Для Каждого Элемент Из Форма.Элементы Цикл
		
		Если ТипЗнч(Элемент) = Тип("ГруппаФормы") Тогда 
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Элемент) = Тип("КнопкаФормы") И Элемент.Родитель.Имя = "ФормаКоманднаяПанель" Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Элемент) = Тип("КнопкаФормы") И Элемент.Родитель.Имя = "КоманднаяПанельФормыСоздатьНаОсновании" Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Элемент) = Тип("КнопкаФормы") И Элемент.Родитель.Имя = "КоманднаяПанельФормыПечать" Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДоступныеПоля = "" Тогда
			Если (НедоступныеПоля <> "") И НедоступныеПоля.Свойство(Элемент.Имя) Тогда  
				Доступность = Ложь;
			Иначе	
				Доступность = Истина;
			КонецЕсли;
		ИначеЕсли ДоступныеПоля.Свойство(Элемент.Имя) Тогда 
			Доступность = Истина;
		Иначе	
			Доступность = Ложь;
		КонецЕсли;	
		
		Если ТипЗнч(Элемент) = Тип("КнопкаФормы") Тогда 
			Элемент.Доступность = Доступность;
		Иначе
			Элемент.ТолькоПросмотр = Не Доступность;
		КонецЕсли;
		
	КонецЦикла;	
	
	// доступность поля состояние зависит от настройки
	Если Не Константы.РазрешитьРучноеИзменениеСостоянияДокументов.Получить() 
		И Константы.ИспользоватьБизнесПроцессыИЗадачи.Получить() Тогда 
		Форма.Элементы.Состояние.ТолькоПросмотр = Истина;
	КонецЕсли;	
	
КонецПроцедуры	

Функция КонтактноеЛицоКорреспондента(Корреспондент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактныеЛица.Ссылка КАК КонтактноеЛицо
	|ИЗ
	|	Справочник.КонтактныеЛица КАК КонтактныеЛица
	|ГДЕ
	|	КонтактныеЛица.Владелец = &Владелец
	|	И (НЕ КонтактныеЛица.ПометкаУдаления)";
	Запрос.УстановитьПараметр("Владелец", Корреспондент);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 1 Тогда 
		Возврат Результат[0].КонтактноеЛицо;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции	

Функция КоличествоДокументовПоВидуДокумента(ВидДокумента) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(ВидДокумента) = Тип("СправочникСсылка.ВидыВнутреннихДокументов") Тогда 
		Тип = "ВнутренниеДокументы";
	ИначеЕсли ТипЗнч(ВидДокумента) = Тип("СправочникСсылка.ВидыВходящихДокументов") Тогда 
		Тип = "ВходящиеДокументы";
	ИначеЕсли ТипЗнч(ВидДокумента) = Тип("СправочникСсылка.ВидыИсходящихДокументов") Тогда 	
		Тип = "ИсходящиеДокументы";
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	Справочник." + Тип + "
	|ГДЕ
	|	ВидДокумента = &ВидДокумента
	|	И РегистрационныйНомер <> """"";
	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		Возврат 0;
	КонецЕсли;	
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Количество;
	
КонецФункции	

Функция КоличествоДокументовПоНумератору(Нумератор) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	Справочник.ВходящиеДокументы КАК ВходящиеДокументы
	|ГДЕ
	|	ВходящиеДокументы.ВидДокумента.Нумератор = &Нумератор
	|	И ВходящиеДокументы.РегистрационныйНомер <> """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*)
	|ИЗ
	|	Справочник.ИсходящиеДокументы КАК ИсходящиеДокументы
	|ГДЕ
	|	ИсходящиеДокументы.ВидДокумента.Нумератор = &Нумератор
	|	И ИсходящиеДокументы.РегистрационныйНомер <> """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*)
	|ИЗ
	|	Справочник.ВнутренниеДокументы КАК ВнутренниеДокументы
	|ГДЕ
	|	ВнутренниеДокументы.ВидДокумента.Нумератор = &Нумератор
	|	И ВнутренниеДокументы.РегистрационныйНомер <> """"";
	Запрос.УстановитьПараметр("Нумератор", Нумератор);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		Возврат 0;
	КонецЕсли;	
	
	Возврат Результат.Выгрузить().Итог("Количество");
	
КонецФункции	

Функция КоличествоДокументовСПустымВидом(ТипДокумента) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипДокумента = "ВходящийДокумент" Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(*) КАК Количество
		|ИЗ
		|	Справочник.ВходящиеДокументы КАК ВходящиеДокументы
		|ГДЕ
		|	ВходящиеДокументы.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыВходящихДокументов.ПустаяСсылка)";
		
	ИначеЕсли ТипДокумента = "ИсходящийДокумент" Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(*) КАК Количество
		|ИЗ
		|	Справочник.ИсходящиеДокументы КАК ИсходящиеДокументы
		|ГДЕ
		|	ИсходящиеДокументы.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыИсходящихДокументов.ПустаяСсылка)";
		
	ИначеЕсли ТипДокумента = "ВнутреннийДокумент" Тогда	
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(*) КАК Количество
		|ИЗ
		|	Справочник.ВнутренниеДокументы КАК ВнутренниеДокументы
		|ГДЕ
		|	ВнутренниеДокументы.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыВнутреннихДокументов.ПустаяСсылка)";
		
	КонецЕсли;	
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат 0;
	КонецЕсли;	
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Количество;
	
КонецФункции	

// Инициализирует персональные настройки работы с документами - для использования на клиенте.
Функция ПолучитьПерсональныеНастройкиРаботыСДокументамиСервер() Экспорт
	Настройки = Новый Структура;

	ПоказыватьПредупреждениеПриРегистрации = ХранилищеОбщихНастроек.Загрузить("НастройкиРаботыСДокументами", "ПоказыватьПредупреждениеПриРегистрации");
	Если ПоказыватьПредупреждениеПриРегистрации = Неопределено Тогда
		ПоказыватьПредупреждениеПриРегистрации = Истина;
		ХранилищеОбщихНастроек.Сохранить("НастройкиРаботыСДокументами", "ПоказыватьПредупреждениеПриРегистрации", ПоказыватьПредупреждениеПриРегистрации);
	КонецЕсли;
	
	Настройки.Вставить("ПоказыватьПредупреждениеПриРегистрации", ПоказыватьПредупреждениеПриРегистрации);
	
	УстановитьПривилегированныйРежим(Истина);
	Настройки.Вставить("ИспользоватьФайлыУВходящихДокументов", Константы.ИспользоватьФайлыУВходящихДокументов.Получить());
	Настройки.Вставить("ИспользоватьФайлыУИсходящихДокументов", Константы.ИспользоватьФайлыУИсходящихДокументов.Получить());
	
	
	Возврат Настройки; // параметры доступны только для чтения
КонецФункции

// Получает актуальное состояние дела
Функция ПолучитьСостояниеДела(Дело) Экспорт
	
	Если Не ЗначениеЗаполнено(Дело) Тогда
		Возврат Перечисления.СостоянияДелХраненияДокументов.ПустаяСсылка();
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостоянияДелХраненияДокументов.Состояние КАК Состояние
	|ИЗ
	|	РегистрСведений.СостоянияДелХраненияДокументов.СрезПоследних(, ДелоХраненияДокументов = &Дело) КАК СостоянияДелХраненияДокументов";
	Запрос.УстановитьПараметр("Дело", Дело);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		Возврат Перечисления.СостоянияДелХраненияДокументов.ПустаяСсылка();
	КонецЕсли;	
		
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Состояние; 
	
КонецФункции

Функция ПолучитьРежимВыбораВидаДокумента(ТипДокумента) Экспорт
	
	Если ТипДокумента = "ВходящийДокумент" Тогда 
		ВидДокумента = "ВидыВходящихДокументов";
	ИначеЕсли ТипДокумента = "ИсходящийДокумент" Тогда 
		ВидДокумента = "ВидыИсходящихДокументов";
	ИначеЕсли ТипДокумента = "ВнутреннийДокумент" Тогда 
		ВидДокумента = "ВидыВнутреннихДокументов";
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрЗаменить(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЛОЖЬ КАК ЗначениеЛожь
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ЛОЖЬ В
	|					(ВЫБРАТЬ ПЕРВЫЕ 1
	|						ЛОЖЬ
	|					ИЗ
	|						&ВидДокумента КАК ТаблицаВидаДокументов
	|					ГДЕ
	|						ТаблицаВидаДокументов.ЭтоГруппа)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ В
	|					(ВЫБРАТЬ
	|						ЛОЖЬ КАК ЗначениеЛожь
	|					ИЗ
	|						(ВЫБРАТЬ ПЕРВЫЕ 16
	|							ИСТИНА КАК ЗначениеИстина
	|						ИЗ
	|							&ВидДокумента КАК ТаблицаВидаДокументов
	|						) КАК ВыбранныеОбъекты
	|					ИМЕЮЩИЕ
	|						КОЛИЧЕСТВО(ВыбранныеОбъекты.ЗначениеИстина) > 15)
	|		КОНЕЦ", "&ВидДокумента", "Справочник." + ВидДокумента);
	
	Результат = Запрос.Выполнить();
	БыстрыйВыборВидаДокумента = Результат.Пустой();
	
	Возврат БыстрыйВыборВидаДокумента;
	
КонецФункции	

// Позволяет проверить изменение признака "удуУчетПоДетям" при записи элемента справочников.
// "Виды...ихДокументов"
Функция удуИзмененПризнакУчетаПоДетям(Объект) Экспорт
	ПризнакИзменен = Ложь;
	
	Если Не Объект.Ссылка.Пустая() Тогда
		ОбъектВБазе =  Объект.Ссылка.ПолучитьОбъект();		
		Если Объект.удуУчетПоДетям <> ОбъектВБазе.удуУчетПоДетям Тогда
			ПризнакИзменен = Истина;
		КонецЕсли;		
	КонецЕсли;
	
	Возврат ПризнакИзменен;
КонецФункции
